import React from "react";
import { Result, Button, notification } from 'antd';
import { SmileOutlined } from '@ant-design/icons';


const openNotification = () => {
  notification.open({
    message: 'ขอบคุณสำหรับการยืนยัน',
    description:
      'เราได้นำส่งข้อมูลไปยังฝ่าย safety',
    icon: <SmileOutlined style={{ color: '#108ee9' }} />,
  });
};

const Analysis = ({score, confirmData, thanks, name }) => (
 <div>
  { score < 8 ? (
    <Result
    status="success"
    title='ระดับความเสี่ยงน้อยมาก'
    extra={[
      <h1>คุณ {name} มีค่าความเสี่ยง Covid น้อยมาก</h1>,
      <h3>1.ปฏิบัติงานตามปกติ </h3>,
      <h3>2.สวมหน้ากากอนามัย และล้างมือด้วยสบู่หรือใช้เจลแอลกอฮอล์ อย่างน้อย 20 วินาที</h3>,
      <h3>3.ปฏิบัติตามหลัก Social Distancing </h3>,
      <h3>4.หลีกเลี่ยงการไปสถานที่แออัด</h3>,
      <h3>5.ยึดหลัก "ล้างมือทั้งวัน กินร้อน ช้อนฉัน ห่างกัน 2 เมตร"</h3>,
      <h3>6.งดแชร์อาหาร</h3>
    ]}
  />
    ) : null}

{ score > 7 && score < 12 ? (<Result
    title='ระดับที่มีความเสี่ยง'
    extra={[
      <h1>คุณ {name} มีค่าความเสี่ยง Covid ในระดับที่มีความเสี่ยง</h1>,
      <h3>1.ในผู้ที่ไม่มีอาการสามารถปฏิบัติงานตามปกติ</h3>,
      <h3>2.สวมหน้ากากอนามัย และล้างมือด้วยสบู่หรือใช้เจลแอลกอฮอล์ อย่างน้อย 20 วินาที</h3>,
      <h3>3.ปฏิบัติตามหลัก Social Distancing </h3>,
      <h3>4.หลีกเลี่ยงการไปสถานที่แออัด</h3>,
      <h3>5.ยึดหลัก "ล้างมือทั้งวัน กินร้อน ช้อนฉัน ห่างกัน 2 เมตร"</h3>,
      <h3>6.งดแชร์อาหาร</h3>,
      <h3>7.ควรหยุดพัก 2 วัน หากอาการไม่ดีขึ้นรีบพบแพทย์</h3>
    ]}/>) : null}


{ score > 11 && score < 20 ? (<Result
    status="warning"
    title='ระดับความเสี่ยงมาก'
    extra={[
      <h1>คุณ {name} มีค่าความเสี่ยง Covid ในระดับที่มีความเสี่ยงมาก</h1>,
      <h3>1.กักกันตัวเองไว้ที่บ้าน 14 วัน และไม่ใช้ของร่วมกับผู้อื่น</h3>,
      <h3>2.สวมหน้ากากอนามัย และล้างมือด้วยสบู่หรือใช้เจลแอลกอฮอล์</h3>,
      <h3>3.สวมหน้ากากอนามัย</h3>,
      <h3>4.หลีกเลี่ยงการไปสถานที่แออัด</h3>,
      <h3>5.งดแชร์อาหาร</h3>,
      <h3>6.แยกห้องนอน</h3>,
      <h3>7.วัดอุณหภูมิร่างกายทุกวันวันละ 2 ครั้ง รายงานผลการวัดอุณหภูมิให้แก่หน่วยงานความปลอดภัยฯ</h3>,
      <h3>8.สังเกตอาการตนเอง - มีไข้ 37.5 องศาเซลเซียสขึ้นไป
   </h3>
    ]}/>) : null}

{ score > 19 ? (<Result
    status="error"
    title='ระดับความเสี่ยงมากที่สุด'
    extra={[
      <h1>คุณ {name} มีค่าความเสี่ยง Covid ระดับความเสี่ยงมากที่สุด</h1>,
      <h3>1.หลีกเลี่ยงการใกล้ชิดกับผู้อื่น</h3>,
      <h3>2.สวมหน้ากากอนามัย และล้างมือด้วยสบู่หรือใช้เจลแอลกอฮอล์ อย่างน้อย 20 วินาที</h3>,
      <h3>3.ปฏิบัติตามหลัก Social Distancing </h3>,
      <h3>4.หลีกเลี่ยงการไปสถานที่แออัด</h3>,
      <h3>5.แยกห้องนอน รวมทั้งของใช้ส่วนตัว</h3>,
      <h3>กรณีอยู่ในบริษัทฯ</h3>,
      <h3>6.แยกกั้นพื้นที่</h3>,
      <h3>7.ทีมสอบสวนโรค หน่วยงานความปลอดภัยฯและพยาบาลวิชาชีพ</h3>,
      <h3>8.นำส่งโรงพยาบาลทันที</h3>,
      <h3>8.1 ค้นหาผู้สัมผัสเสี่ยงสูง เสี่ยงต่ำ และดำเนินการตามาตรการของแต่ละระดับความเสี่ยงต่อการรับเชื้อ</h3>,
      <h3>8.2 ฉีดพ่นฆ่าเชื้อพื้นที่บริษัทฯ</h3>,


    ]}/>) : null}


  
{thanks === false && (<Button type="primary" block onClick={function(event){confirmData(); openNotification()}}>
      ยืนยันผล
      </Button>)}
    
   
     
  </div>
);

export default Analysis;
